app/controllers/admin/audiences_controller.rb

SELECT * FROM `audiences`
---
  def index
    @audiences = Audience.all

SELECT * FROM `audiences` WHERE (`audiences`.`id` = 4)
---
  def show
    @audience = Audience.find(params[:id])

SELECT * FROM `audiences` WHERE (`audiences`.`id` = 2)
---
  def edit
    @audience = Audience.find(params[:id])

INSERT INTO `audiences` (`name`, `created_at`, `updated_at`) VALUES('Public', '2010-03-05 10:57:47', '2010-03-05 10:57:47')
---
  def create
    @audience = Audience.new(params[:audience])

    respond_to do |format|
      if @audience.save

SELECT * FROM `audiences` WHERE (`audiences`.`id` = 2)
---
  def update
    @audience = Audience.find(params[:id])

SELECT * FROM `audiences` WHERE (`audiences`.`id` = 1)
DELETE FROM `audiences` WHERE `id` = 1
---
  def destroy
    @audience = Audience.find(params[:id])

    if @audience.destroy then