app/controllers/admin/categories_controller.rb

  def index
    @categories = Category.all
---
SELECT * FROM `categories`

  def show
    @category = Category.find(params[:id])
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 1)

  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES('Transport', '2010-03-05 12:11:43', '2010-03-05 12:11:43')

  def destroy
    @category = Category.find(params[:id])
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 2)