app/controllers/admin/datasets_controller.rb

  def index
    @datasets = Dataset.all
---
SELECT * FROM `datasets`

  def show
    @dataset = Dataset.find(params[:id])
---
SELECT * FROM `datasets` WHERE (`datasets`.`id` = 1) LIMIT 1

  def edit
    @dataset = Dataset.find(params[:id])
---
SELECT * FROM `datasets` WHERE (`datasets`.`id` = 1) LIMIT 1

  def create
    @dataset = Dataset.new(params[:dataset])

    respond_to do |format|
      if @dataset.save
---
INSERT INTO `datasets` (`name`, `audience_id`, `xml_url`, `licence_id`, `created_at`, `csv_url`, `updated_at`, `geo_extent`, `maintainer`, `date_range_start`, `version`, `language_id`, `update_frequency`, `category_id`, `display_title`, `description`, `publish_date`, `metadata_date`, `contact_email`, `info_url`, `date_range_end`) VALUES('Deaths in service', 12, 'http://lemon.com', NULL, '2010-03-05 12:04:05', 'http://lemon.com', '2010-03-05 12:04:05', 'Warks', 'Me', '2010-03-05 12:02:00', 1, 1, 'Every Weds', 1, 'Lemons', 'ALll', '2010-03-05', '2010-03-05', 'steve.paperjam@gmail.com', 'http://lemon.com', '2010-05-05 12:02:00')

  def update
    @dataset = Dataset.find(params[:id])

    respond_to do |format|
      if @dataset.update_attributes(params[:dataset])
---
SELECT * FROM `datasets` WHERE (`datasets`.`id` = 1) LIMIT 1
UPDATE `datasets` SET `updated_at` = '2010-03-11 23:16:43', `description` = 'To estimate missing data, the supplied data for 2007/08 has been used if at least three quarterly periods have been supplied for 2007/08. If fewer than three quarterly periods have been supplied for 2007/08 then data from 2006/07 has been used and the average percentage increase/decrease for that region has been applied to the 2006/07 data to estimate the 2007/08 figure. This is the estimation method used for previous years\' data. Ealing\'s 2007/08 figure is the number of abandoned vehicles of which the authority has disposed. Previous figures for Ealing are the number of abandoned vehicles reported to the authority.' WHERE `id` = 1