app/controllers/admin/languages_controller.rb

SELECT * FROM `languages`
---
  def index
    @languages = Language.all

SELECT * FROM `languages` WHERE (`languages`.`id` = 2)
---
  def show
    @language = Language.find(params[:id])

SELECT * FROM `languages` WHERE (`languages`.`id` = 1)
---
  def edit
    @language = Language.find(params[:id])

SELECT * FROM `languages` WHERE (`languages`.`id` = 1)
---
  def update
    @language = Language.find(params[:id])

SELECT * FROM `languages` WHERE (`languages`.`id` = 5)
---
  def destroy
    @language = Language.find(params[:id])