app/controllers/admin/licences_controller.rb

  def index
    @licences = Licence.all
---
SELECT * FROM `licences`

  def show
    @licence = Licence.find(params[:id])
---
SELECT * FROM `licences` WHERE (`licences`.`id` = 1)

  def edit
    @licence = Licence.find(params[:id])
---
SELECT * FROM `licences` WHERE (`licences`.`id` = 1)

  def create
    @licence = Licence.new(params[:licence])

    respond_to do |format|
      if @licence.save
---
INSERT INTO `licences` (`name`, `created_at`, `updated_at`, `description`, `link`) VALUES('WTFPL', '2010-03-05 11:35:10', '2010-03-05 11:35:10', 'WTFPL?', '')

  def update
    @licence = Licence.find(params[:id])

    respond_to do |format|
      if @licence.update_attributes(params[:licence])
---
SELECT * FROM `licences` WHERE (`licences`.`id` = 4)
UPDATE `licences` SET `updated_at` = '2010-03-05 11:35:19', `description` = 'WTFPL? ??' WHERE `id` = 4

  def destroy
    @licence = Licence.find(params[:id])
    @licence.destroy
---
SELECT * FROM `licences` WHERE (`licences`.`id` = 3)
DELETE FROM `licences` WHERE `id` = 3