app/controllers/admin/pages_controller.rb

  def index
    @pages = Page.all
---
SELECT * FROM `pages`

  def show
    @page = Page.find(params[:id])
---
SELECT * FROM `pages` WHERE (`pages`.`id` = 1)

  def edit
    @page = Page.find(params[:id])
---
SELECT * FROM `pages` WHERE (`pages`.`id` = 1)

  def create
    @page = Page.new(params[:page])

    respond_to do |format|
      if @page.save
---
INSERT INTO `pages` (`created_at`, `title`, `author`, `updated_at`, `date`, `order`, `content`, `status`) VALUES('2010-03-10 13:57:30', 'Community', 2, '2010-03-10 13:57:30', '2010-03-10 13:56:00', 10, '<p>Here\'s my community page. It\'s the greatest, possibly.</p>\r\n\r\n', 'draft')

  def update
    @page = Page.find(params[:id])

    respond_to do |format|
      if @page.update_attributes(params[:page])
---
SELECT * FROM `pages` WHERE (`pages`.`id` = 1)
UPDATE `pages` SET `updated_at` = '2010-03-10 14:23:10', `status` = 'published' WHERE `id` = 1