app/controllers/admin/users_controller.rb

SELECT * FROM `users`
---
    def index
      @users = User.all

SELECT * FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
---
     def show
       @user = User.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
---
     def edit
       @user = User.find(params[:id])

INSERT INTO `users` (`salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `remember_token`, `login`, `email`) VALUES('592fbcafe9d03dfc015de5dfa78ff01526c3f904', '2010-03-05 19:06:25', '54524c6f862d1c6b99538c467ee7d41d5f139937', NULL, '2010-03-05 19:06:25', NULL, 'captainfishy', 'captainfishy@madeofstring.co.uk')
---
     def create
       @user = User.new(params[:user])

       respond_to do |format|
         if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
UPDATE `users` SET `updated_at` = '2010-03-10 09:49:38', `last_name` = '', `first_name` = 'Steve' WHERE `id` = 2
---
     def update
       @user = User.find(params[:id])

       respond_to do |format|
         if @user.update_attributes(params[:user])