app/controllers/audiences_controller.rb

  def index
    @audiences = Audience.all
---
SELECT * FROM `audiences`

  def show
    @audience = Audience.find(params[:id])
---
SELECT * FROM `audiences` WHERE (`audiences`.`id` = 1)

  def create
    @audience = Audience.new(params[:audience])

    respond_to do |format|
      if @audience.save
---
INSERT INTO `audiences` (`name`, `created_at`, `updated_at`) VALUES('Public', '2010-03-03 18:01:48', '2010-03-03 18:01:48')