app/controllers/blogposts_controller.rb

SELECT * FROM `blogposts`
---
  def index
    @title = "Blog"
    @blogpost = Blogpost.all

SELECT * FROM `blogposts` WHERE (`blogposts`.`id` = 1)
---
   def show
     @blogpost = Blogpost.find(params[:id])

SELECT * FROM `blogposts` WHERE (`blogposts`.`id` = 2)
---
   def edit
     @blogpost = Blogpost.find(params[:id])

INSERT INTO `blogposts` (`created_at`, `author`, `title`, `updated_at`, `published`, `content`, `synopsis`, `publishdate`) VALUES('2010-03-03 16:32:01', 'Steve Woodward', 'My story', '2010-03-03 16:32:01', 1, 'Uh. Here is my content.', 'It\'s amazig.', '2010-03-04 16:31:00')
---
   def create
     @blogpost = Blogpost.new(params[:blogpost])

     respond_to do |format|
       if @blogpost.save

SELECT * FROM `blogposts` WHERE (`blogposts`.`id` = 2)
UPDATE `blogposts` SET `content` = 'Rabbits. Rabbits. Rabbits. Rabbits', `updated_at` = '2010-03-03 16:57:17' WHERE `id` = 2
---
   def update
     @blogpost = Blogpost.find(params[:id])

     respond_to do |format|
       if @blogpost.update_attributes(params[:blogpost])