app/controllers/categories_controller.rb

SELECT * FROM `categories`
---
  def index
    #@categories = Category.find(:all, :order=>'name ASC')
    @datasets = Dataset.all(:select =>'count(*) AS count, category_id, categories.name AS category_name', :joins=>:category, :conditions => {:status => "Published"}, :group =>'category_id', :order=>"category_name ASC")

SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
---
  def show
    @category = Category.find(params[:id])