app/controllers/datasets_controller.rb

SELECT * FROM `datasets` ORDER BY name ASC
---
  def index
    @datasets = Dataset.all

SELECT * FROM `datasets` WHERE (`datasets`.`id` = 1) LIMIT 1
---
  def show
    @dataset = Dataset.find(params[:id])