app/controllers/data_controller.rb

   def index
     @datasets = Dataset.all
---
SELECT * FROM `datasets`

   def show
     @dataset = Dataset.find(params[:id])
---
SELECT * FROM `datasets` WHERE (`datasets`.`id` = 2)