app/controllers/licences_controller.rb

SELECT * FROM `licences`
---
  def index
    @licences = Licence.all

SELECT * FROM `licences` WHERE (`licences`.`id` = 1)
---
  def show
    @licence = Licence.find(params[:id])

INSERT INTO `licences` (`name`, `created_at`, `updated_at`, `description`, `link`) VALUES('GPL', '2010-03-04 17:18:25', '2010-03-04 17:18:25', 'It\'s the GPL, right?', '')
---
  def create
    @licence = Licence.new(params[:licence])

    respond_to do |format|
      if @licence.save