app/controllers/pages_controller.rb

SELECT * FROM `pages`
---
  def index
    @pages = Page.all

SELECT * FROM `pages` WHERE (`pages`.`id` = 1)
---
  def show
    @page = Page.find(params[:id])