app/controllers/tag_controller.rb

   def index


     @tags = Dataset.all
---
SELECT * FROM `datasets`