app/controllers/tags_controller.rb

   def index
    @sorted_tags = Dataset.all(:select=>'tags.*, count(*) as count',:conditions => {:status => "Published"},:joins=>:tags, :group=>"tags.id, tags.name").sort { |x,y| x.name.upcase <=> y.name.upcase }
---
SELECT * FROM `datasets` WHERE (`datasets`.`status` = 'published') ORDER BY name ASC
SELECT tags.*, COUNT(*) AS count FROM `tags` LEFT OUTER JOIN taggings ON tags.id = taggings.tag_id AND taggings.context = 'tags' INNER JOIN datasets ON datasets.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Dataset' AND taggings.taggable_id = 1) GROUP BY tags.id, tags.name HAVING COUNT(*) > 0

   def show
     @tag = Tag.find(params[:id])

     @datasets = Dataset.find_tagged_with(@tag.name, :on =>:tags, :conditions => {:status => "Published"}, :order=> "name ASC")
---
SELECT * FROM `tags` WHERE (name LIKE 'education')
SELECT `datasets`.* FROM `datasets` JOIN taggings datasets_taggings_senselessdeath_632 ON datasets_taggings_senselessdeath_632.taggable_id = datasets.id AND datasets_taggings_senselessdeath_632.taggable_type = 'Dataset' AND datasets_taggings_senselessdeath_632.tag_id = 7 AND datasets_taggings_senselessdeath_632.context = 'tags' WHERE (`datasets`.`status` = 'published') ORDER BY name ASC