app/controllers/users_controller.rb

  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @user.save
---
INSERT INTO `users` (`salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `remember_token`, `login`, `email`) VALUES('5691b3f8aee914c1994eddcf90d631ac6fb0face', '2010-03-04 14:42:39', '4c67994196015c214c3af59ca6f08de48aa9f585', NULL, '2010-03-04 14:42:39', NULL, 'equaliser', 'steve.paperjam@gmail.com')